---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction.CurrentConstruction
source: html/9343345f-f3ce-474e-88f8-d0b709d55a84.htm
---
# Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction.CurrentConstruction Property

Get all the Building Constructions according to the specific Construction type.

## Syntax (C#)
```csharp
public MEPBuildingConstruction CurrentConstruction { get; set; }
```

## Remarks
This property is used to get or set the Building Service of the Project Information.